Repository: aireels-dev/mini-cal
Catalog: MiniCal/Resources/Localizations/Localizable.xcstrings
Source language: en
Languages: ar, fa, he, ja, ko, th, tr, ur, vi, zh_hans, zh_hant

# subscription.refresh_all_button
source: Refresh All
ar: تحديث الكل
fa: به‌روزرسانی همه
he: רענן הכל
ja: すべて更新
ko: 모두 새로 고침
th: รีเฟรชทั้งหมด
tr: Tümünü Yenile
ur: سب کو تازہ کریں
vi: Làm mới tất cả
zh_hans: 全部刷新
zh_hant: 全部刷新

# subscription.refresh_all_help
source: Refresh all subscribed calendar data
ar: تحديث جميع بيانات التقويم المشترك بها
fa: به‌روزرسانی همه داده‌های تقویم مشترک
he: רענן את כל נתוני לוחות השנה במנוי
ja: すべての購読カレンダーデータを更新
ko: 모든 구독 달력 데이터 새로고침
th: รีเฟรชข้อมูลปฏิทินที่สมัครสมาชิกทั้งหมด
tr: Tüm abone olunan takvim verilerini yenile
ur: تمام سبسکرائب کیلنڈر ڈیٹا تازہ کریں
vi: Làm mới tất cả dữ liệu lịch đã đăng ký
zh_hans: 刷新所有订阅的日历数据
zh_hant: 刷新所有訂閱的日曆資料

source: Subscription URL
ar: عنوان URL للاشتراك
fa: آدرس URL اشتراک
he: כתובת URL למינוי
ja: サブスクリプション URL
ko: 구독 URL
th: URL การสมัครสมาชิก
tr: Abonelik URL'si
ur: رکنیت URL
vi: URL đăng ký
zh_hans: 订阅 URL
zh_hant: 訂閱 URL

# subscription.url_input_placeholder
source: Enter external calendar URL
ar: أدخل عنوان URL للتقويم الخارجي
fa: آدرس URL تقویم خارجی را وارد کنید
he: הזן כתובת URL של לוח שנה חיצוני
ja: 外部カレンダーのURLを入力
ko: 외부 달력 URL 입력
th: ป้อน URL ปฏิทินภายนอก
tr: Harici takvim URL'sini girin
ur: بیرونی کیلنڈر کا URL درج کریں
vi: Nhập URL lịch bên ngoài
zh_hans: 输入外部日历的URL地址
zh_hant: 輸入外部日曆的URL地址

# sync_status.disabled
source: Disabled
ar: معطل
fa: غیرفعال
he: מושבת
ja: 無効
ko: 비활성화
th: ปิดใช้งาน
tr: Devre Dışı
ur: غیر فعال
vi: Vô hiệu
zh_hans: 已禁用
zh_hant: 已禁用

# sync_status.failed
source: Failed
ar: فشل
fa: ناموفق
he: נכשל
ja: 失敗
ko: 실패
th: ล้มเหลว
tr: Başarısız
ur: ناکام
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

# sync_status.idle
source: Idle
ar: خامل
fa: بیکار
he: לא פעיל
ja: 待機中
ko: 대기
th: ว่าง
tr: Boşta
ur: بیکار
vi: Rảnh
zh_hans: 空闲
zh_hant: 空閒

# sync_status.rateLimited
source: Rate Limited
ar: محدود المعدل
fa: محدودیت نرخ
he: מוגבל בקצב
ja: レート制限
ko: 속도 제한
th: จำกัดอัตรา
tr: Hız Sınırlı
ur: شرح محدود
vi: Giới hạn tốc độ
zh_hans: 频率限制
zh_hant: 頻率限制

# sync_status.success
source: Success
ar: نجح
fa: موفق
he: הצליח
ja: 成功
ko: 성공
th: สำเร็จ
tr: Başarılı
ur: کامیاب
vi: Thành công
zh_hans: 成功
zh_hant: 成功

# sync_status.syncing
source: Syncing
ar: جاري المزامنة
fa: در حال همگام‌سازی
he: מסנכרן
ja: 同期中
ko: 동기화 중
th: กำลังซิงค์
tr: Senkronize Ediliyor
ur: ہم وقت سازی میں
vi: Đang đồng bộ
zh_hans: 同步中
zh_hant: 同步中

# system_calendar.event_count
source: %d events
ar: %d أحداث
fa: %d رویداد
he: %d אירועים
ja: %d 件のイベント
ko: %d개 이벤트
th: %d เหตุการณ์
tr: %d etkinlik
ur: %d واقعات
vi: %d sự kiện
zh_hans: %d 个事件
zh_hant: %d 個事件

# theme_mode.auto
source: Auto
ar: تلقائي
fa: خودکار
he: אוטומטי
ja: 自動
ko: 자동
th: อัตโนมัติ
tr: Otomatik
ur: خودکار
vi: Tự động
zh_hans: 自动
zh_hant: 自動

# theme_mode.auto.description
source: Automatically switch following macOS system appearance
ar: التبديل التلقائي باتباع مظهر نظام macOS
fa: تغییر خودکار با پیروی از ظاهر سیستم macOS
he: החלף אוטומטית בהתאם למראה מערכת macOS
ja: macOS システムの外観に従って自動的に切り替え
ko: macOS 시스템 외관에 따라 자동 전환
th: สลับอัตโนมัติตามรูปลักษณ์ระบบ macOS
tr: macOS sistem görünümünü takip ederek otomatik geçiş yap
ur: macOS سسٹم ظہور کی پیروی کرتے ہوئے خودکار سوئچ
vi: Tự động chuyển đổi theo giao diện hệ thống macOS
zh_hans: 跟随 macOS 系统外观自动切换
zh_hant: 跟隨 macOS 系統外觀自動切換

# theme_mode.dark
source: Dark
ar: داكن
fa: تیره
he: כהה
ja: ダーク
ko: 다크
th: มืด
tr: Koyu
ur: گہرا
vi: Tối
zh_hans: 深色
zh_hant: 深色

# theme_mode.dark.description
source: Always use dark theme, suitable for dim environments or nighttime
ar: استخدم دائماً المظهر الداكن، مناسب للبيئات المعتمة أو الليل
fa: همیشه از تم تیره استفاده کنید، مناسب برای محیط های کم نور یا شب
he: השתמש תמיד בערכת נושא כהה, מתאים לסביבות עמומות או שימוש לילי
ja: 常にダークテーマを使用、暗い環境や夜間に適しています
ko: 항상 다크 테마 사용, 어두운 환경이나 야간에 적합
th: ใช้ธีมมืดเสมอ เหมาะสำหรับสภาพแวดล้อมที่มืดหรือเวลากลางคืน
tr: Her zaman koyu tema kullan, karanlık ortamlar veya gece için uygundur
ur: ہمیشہ گہرا تھیم استعمال کریں، مدھم ماحول یا رات کے لیے موزوں
vi: Luôn sử dụng chủ đề tối, phù hợp cho môi trường tối hoặc ban đêm
zh_hans: 始终使用深色主题，适合在昏暗环境或夜间使用
zh_hant: 始終使用深色主題，適合在昏暗環境或夜間使用

# theme_mode.light
source: Light
ar: فاتح
fa: روشن
he: בהיר
ja: ライト
ko: 라이트
th: สว่าง
tr: Açık
ur: ہلکا
vi: Sáng
zh_hans: 浅色
zh_hant: 淺色

# theme_mode.light.description
source: Always use light theme, suitable for bright environments
ar: استخدم دائماً المظهر الفاتح، مناسب للبيئات المضيئة
fa: همیشه از تم روشن استفاده کنید، مناسب برای محیط های روشن
he: השתמש תמיד בערכת נושא בהירה, מתאים לסביבות בהירות
ja: 常にライトテーマを使用、明るい環境に適しています
ko: 항상 라이트 테마 사용, 밝은 환경에 적합
th: ใช้ธีมสว่างเสมอ เหมาะสำหรับสภาพแวดล้อมที่สว่าง
tr: Her zaman açık tema kullan, parlak ortamlar için uygundur
ur: ہمیشہ ہلکا تھیم استعمال کریں، روشن ماحول کے لیے موزوں
vi: Luôn sử dụng chủ đề sáng, phù hợp cho môi trường sáng
zh_hans: 始终使用浅色主题，适合在明亮环境下使用
zh_hant: 始終使用淺色主題，適合在明亮環境下使用

# theme.amber_orange
source: Amber Orange
ar: البرتقالي الكهرماني
fa: نارنجی کهربایی
he: כתום ענבר
ja: アンバーオレンジ
ko: 앰버 오렌지
th: สีส้มอำพัน
tr: Kehribar Turuncu
ur: کہربا نارنجی
vi: Cam hổ phách
zh_hans: 琥珀橙
zh_hant: 琥珀橙

# theme.classic_blue
source: Classic Blue
ar: الأزرق الكلاسيكي
fa: آبی کلاسیک
he: כחול קלאסי
ja: クラシックブルー
ko: 클래식 블루
th: สีน้ำเงินคลาสสิก
tr: Klasik Mavi
ur: کلاسک بلیو
vi: Xanh cổ điển
zh_hans: 经典蓝
zh_hant: 經典藍

# theme.dark_green
source: Dark Green
ar: الأخضر الداكن
fa: سبز تیره
he: ירוק כהה
ja: ダークグリーン
ko: 다크 그린
th: สีเขียวเข้ม
tr: Koyu Yeşil
ur: گہرا سبز
vi: Xanh tối
zh_hans: 暗夜绿
zh_hant: 暗夜綠

# theme.dark_magenta
source: Dark Magenta
ar: الأرجواني الداكن
fa: ارغوانی تیره
he: מגנטה כהה
ja: ダークマゼンタ
ko: 다크 마젠타
th: สีม่วงแดงเข้ม
tr: Koyu Macenta
ur: گہرا جامنی
vi: Tím đỏ tối
zh_hans: 暗紫红
zh_hant: 暗紫紅

# theme.deep_purple
source: Deep Purple
ar: البنفسجي العميق
fa: بنفش عمیق
he: סגול עמוק
ja: ディープパープル
ko: 딥 퍼플
th: สีม่วงเข้ม
tr: Koyu Mor
ur: گہرا جامنی
vi: Tím đậm
zh_hans: 深邃紫
zh_hant: 深邃紫

# theme.deep_teal
source: Deep Teal
ar: الفيروزي العميق
fa: فیروزه‌ای تیره
he: טורקיז עמוק
ja: ディープティール
ko: 딥 틸
th: สีฟ้าเข้ม
tr: Koyu Camgöbeği
ur: گہرا نیلا
vi: Xanh ngọc đậm
zh_hans: 深海青
zh_hant: 深海青

# theme.forest_green
source: Forest Green
ar: الأخضر الغابي
fa: سبز جنگلی
he: ירוק יער
ja: フォレストグリーン
ko: 포레스트 그린
th: สีเขียวป่า
tr: Orman Yeşili
ur: جنگل کا سبز
vi: Xanh rừng
zh_hans: 翠绿森林
zh_hant: 翠綠森林

# theme.graphite_gray
source: Graphite Gray
ar: الرمادي الجرافيت
fa: خاکستری گرافیتی
he: אפור גרפיט
ja: グラファイトグレー
ko: 그래파이트 그레이
th: สีเทาแกรไฟต์
tr: Grafit Gri
ur: گریفائٹ سرمئی
vi: Xám than chì
zh_hans: 石墨灰
zh_hant: 石墨灰

# theme.indigo_purple
source: Indigo Purple
ar: البنفسجي النيلي
fa: بنفش نیلی
he: סגול אינדיגו
ja: インディゴパープル
ko: 인디고 퍼플
th: สีม่วงครามท่า
tr: Çivit Moru
ur: نیلا جامنی
vi: Tím chàm
zh_hans: 靛蓝紫
zh_hant: 靛藍紫

# theme.lavender_purple
source: Lavender Purple
ar: البنفسجي الخزامى
fa: بنفش اسطوخودوس
he: סגול לבנדר
ja: ラベンダーパープル
ko: 라벤더 퍼플
th: สีม่วงลาเวนเดอร์
tr: Lavanta Moru
ur: لیوینڈر جامنی
vi: Tím hoa oải hương
zh_hans: 薰衣草紫
zh_hant: 薰衣草紫

# theme.midnight_blue
source: Midnight Blue
ar: الأزرق منتصف الليل
fa: آبی نیمه‌شب
he: כחול חצות
ja: ミッドナイトブルー
ko: 미드나이트 블루
th: สีน้ำเงินเที่ยงคืน
tr: Gece Yarısı Mavisi
ur: آدھی رات کا نیلا
vi: Xanh nửa đêm
zh_hans: 午夜蓝
zh_hant: 午夜藍

# theme.neutral_gray
source: Neutral Gray
ar: الرمادي المحايد
fa: خاکستری خنثی
he: אפור נייטרלי
ja: ニュートラルグレー
ko: 뉴트럴 그레이
th: สีเทากลาง
tr: Nötr Gri
ur: غیر جانبدار سرمئی
vi: Xám trung tính
zh_hans: 中性灰
zh_hant: 中性灰

# theme.ocean_teal
source: Ocean Teal
ar: الفيروزي المحيطي
fa: فیروزه‌ای اقیانوس
he: טורקיז אוקיינוס
ja: オーシャンティール
ko: 오션 틸
th: สีฟ้าทะเล
tr: Okyanus Camgöbeği
ur: سمندری نیلا
vi: Xanh ngọc đại dương
zh_hans: 海洋青
zh_hant: 海洋青

# theme.rose_pink
source: Rose Pink
ar: الوردي الوردي
fa: صورتی گلی
he: ורוד ורד
ja: ローズピンク
ko: 로즈 핑크
th: สีชมพูกุหลาบ
tr: Gül Pembesi
ur: گلابی گلاب
vi: Hồng hoa hồng
zh_hans: 玫瑰粉
zh_hant: 玫瑰粉

# theme.sky_blue
source: Sky Blue
ar: الأزرق السماوي
fa: آبی آسمانی
he: כחול שמיים
ja: スカイブルー
ko: 스카이 블루
th: สีฟ้าท้องฟ้า
tr: Gök Mavisi
ur: آسمانی نیلا
vi: Xanh trời
zh_hans: 天空蓝
zh_hant: 天空藍

# theme.sunset_orange
source: Sunset Orange
ar: البرتقالي الغروب
fa: نارنجی غروب
he: כתום שקיעה
ja: サンセットオレンジ
ko: 선셋 오렌지
th: สีส้มพระอาทิตย์ตก
tr: Gün Batımı Turuncu
ur: غروب کا نارنجی
vi: Cam hoàng hôn
zh_hans: 阳光橙
zh_hant: 陽光橙

source: Today
ar: اليوم
he: היום
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hant: 今天

# weekday.fri
source: Fri
ar: الجمعة
fa: ج
he: ו׳
ja: 金
ko: 금
th: ศ
tr: Cum
ur: جمعہ
vi: T6
zh_hans: 五
zh_hant: 五

# weekday.mon
source: Mon
ar: الإثنين
fa: د
he: ב׳
ja: 月
ko: 월
th: จ
tr: Pzt
ur: پیر
vi: T2
zh_hans: 一
zh_hant: 一

# weekday.monday
source: Monday
ar: الاثنين
fa: دوشنبه
he: יום שני
ja: 月曜日
ko: 월요일
th: วันจันทร์
tr: Pazartesi
ur: پیر
vi: Thứ Hai
zh_hans: 周一
zh_hant: 週一

# weekday.sat
source: Sat
ar: السبت
fa: ش
he: ש׳
ja: 土
ko: 토
th: ส
tr: Cmt
ur: ہفتہ
vi: T7
zh_hans: 六
zh_hant: 六

# weekday.sun
source: Sun
ar: الأحد
fa: ی
he: א׳
ja: 日
ko: 일
th: อา
tr: Paz
ur: اتوار
vi: CN
zh_hans: 日
zh_hant: 日

# weekday.sunday
source: Sunday
ar: الأحد
fa: یکشنبه
he: יום ראשון
ja: 日曜日
ko: 일요일
th: วันอาทิตย์
tr: Pazar
ur: اتوار
vi: Chủ nhật
zh_hans: 周日
zh_hant: 週日

# weekday.thu
source: Thu
ar: الخميس
fa: پ
he: ה׳
ja: 木
ko: 목
th: พฤ
tr: Per
ur: جمعرات
vi: T5
zh_hans: 四
zh_hant: 四

# weekday.tue
source: Tue
ar: الثلاثاء
fa: س
he: ג׳
ja: 火
ko: 화
th: อ
tr: Sal
ur: منگل
vi: T3
zh_hans: 二
zh_hant: 二

# weekday.wed
source: Wed
ar: الأربعاء
fa: چ
he: ד׳
ja: 水
ko: 수
th: พ
tr: Çar
ur: بدھ
vi: T4
zh_hans: 三
zh_hant: 三

# 确定要删除事件「%@」吗？此操作无法撤销。
source: Are you sure you want to delete the event "%@"? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف الحدث "%@"؟ لا يمكن التراجع عن هذا الإجراء.
fa: آیا مطمئن هستید که می‌خواهید رویداد «%@» را حذف کنید؟ این عمل قابل بازگشت نیست.
he: האם אתה בטוח שברצונך למחוק את האירוע "%@"? פעולה זו אינה ניתנת לביטול.
ja: イベント「%@」を削除してもよろしいですか？この操作は元に戻せません。
ko: 이벤트 "%@"을(를) 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
th: คุณแน่ใจหรือไม่ว่าต้องการลบกิจกรรม "%@"? การดำเนินการนี้ไม่สามารถยกเลิกได้
tr: "%@" etkinliğini silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.
ur: کیا آپ واقعی ایونٹ "%@" کو حذف کرنا چاہتے ہیں؟ یہ عمل واپس نہیں کیا جا سکتا۔
vi: Bạn có chắc chắn muốn xóa sự kiện "%@" không? Hành động này không thể hoàn tác.
zh_hans: 确定要删除事件「%@」吗？此操作无法撤销。
zh_hant: 確定要刪除事件「%@」嗎？此操作無法撤銷。

# app_name
source: UniCal
zh_hans: 闪历
zh_hant: 閃歷

# menu.onboarding
source: Startup Guide...
zh_hans: 启动引导...
zh_hant: 啟動引導...

# recommendation.collapse
source: Collapse
zh_hans: 收起
zh_hant: 收起

# recommendation.dismiss
source: Dismiss
zh_hans: 关闭
zh_hant: 關閉

# recommendation.dismiss_forever
source: Don't recommend this type again
zh_hans: 不再推荐此类型
zh_hant: 不再推薦此類型

# recommendation.security_alert.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# recommendation.security_alert.confirm
source: I understand and subscribe
zh_hans: 我已了解并订阅
zh_hant: 我已了解並訂閱

# recommendation.security_alert.message
source: ⚠️ Important: External subscriptions may contain inaccurate or malicious content. Please only subscribe to sources you trust. %@ is not responsible for third-party content.
zh_hans: ⚠️ 重要提示：外部订阅可能包含不准确或恶意信息。请仅订阅您信任的来源。%@ 不对第三方内容负责。
zh_hant: ⚠️ 重要提示：外部訂閱可能包含不準確或惡意信息。請僅訂閱您信任的來源。%@ 不對第三方內容負責。

# recommendation.security_alert.title
source: Subscribe to External Calendar
zh_hans: 订阅外部日历
zh_hant: 訂閱外部日曆

# recommendation.switch_calendar.subtitle
source: We found {count} recommended subscriptions for you
zh_hans: 为您推荐了 {count} 个订阅源
zh_hant: 為您推薦了 {count} 個訂閱源

# recommendation.switch_calendar.title
source: You've switched to {calendar}
zh_hans: 您已切换到{calendar}
zh_hant: 您已切換到{calendar}

# recommendation.view_all
source: View All
zh_hans: 查看全部
zh_hant: 查看全部

# settings.week_start.monday_desc
source: Start from Monday (China, Europe, etc.)
zh_hans: 从周一开始（中国、欧洲等）
zh_hant: 從週一開始（中國、歐洲等）

# settings.week_start.section
source: Week Start Day
zh_hans: 每周起始日
zh_hant: 每週起始日

# settings.week_start.sunday_desc
source: Start from Sunday (US, Japan, etc.)
zh_hans: 从周日开始（美国、日本等）
zh_hant: 從週日開始（美國、日本等）

# weekday.friday
source: Friday
zh_hans: 周五
zh_hant: 週五

# weekday.saturday
source: Saturday
zh_hans: 周六
zh_hant: 週六

# weekday.thursday
source: Thursday
zh_hans: 周四
zh_hant: 週四

# weekday.tuesday
source: Tuesday
zh_hans: 周二
zh_hant: 週二

# weekday.wednesday
source: Wednesday
zh_hans: 周三
zh_hant: 週三
